# Лабораторная работа 1.

**Подготовьте и проверьте работоспособность среды для разработки на C++**

## 1 вариант

Установить VS Code - https://code.visualstudio.com/

Настроить его для C++: установить компилятор, ... + расширение для VS Code,  
инструкции и примеры - https://code.visualstudio.com/docs/languages/cpp

или -- аналогично с любым другим подходящим редактором кода

## 2 вариант

Установить IDE

Visual Studio (только для Windows и Mac) - https://visualstudio.microsoft.com

или

любую другую подходящую IDE для работы с C++

---

## Задачи для самостоятельного выполнения

### 1. Рассмотрите пример простой программы:

**Известны стороны прямоугольника. Составить программу, выводящую на экран его площадь.**

Пример решения:

```cpp
#include <iostream>
using namespace std;

int main()
{
    double a, b, s; // объявление трех вещественных переменных
    cout << "Введите длины сторон \n"; // вывод на экран подсказки Введите длины сторон и
    // перевод курсора на новую строку - \n
    cout << "a= "; // вывод a=
    cin >> a; // ввод значения в переменную a
    cout << "b= "; // вывод b=
    cin >> b; // ввод значения в переменную b
    s = a * b; // вычисление значения переменной s
    cout << "S = " << s; //вывод S= и значения переменной s
    return 0;
}
```
Разместить это решение в файле с расширением .cpp, скомпилировать и запустить программу, протестировать ее.

2. Известны два действительных числа. Составить программу, выводящую на экран их сумму, разность и произведение.
3. Известна температура, заданная в градусах Цельсия (tC). Вывести эту же температуру в градусах шкалы Фаренгейта (tF) и шкалы Кельвина (tK).
Считать, что tF = 9/5 (tС) +32, tК = tС + 273

4. Составить программу для вычисления объема шара по радиусу:
$V = \frac{4}{3} \pi R^3$
(число π объявить как типизированную константу равную 3.14159)

Замечание: объявление типизированной константы делается как объявление переменной с квалификатором const, пример:

```cpp
const double PI = 3.141592653589793238463;
```
5. Рассмотрите пример программы с использованием математических функций из <cmath>:
Известна площадь круга. Составить программу, выводящую на экран его радиус и длину окружности.

Пример решения:

```cpp
#define _USE_MATH_DEFINES
#include <iostream>
#include <cmath>
using namespace std;

int main()
{
    double radius, length, area; // радиус, длина окружности, площадь
    cout << "Введите площадь S = "; // вывод на экран подсказки для пользователя
    cin >> area; // ввод значения в переменную S
    radius = sqrt(area / M_PI); // вычисление радиуса
    length = 2.0 * M_PI * radius; // вычисление длины окружности
    cout << "радиус = " << radius << endl; //вывод значения радиуса
    // перевод курсора на новую строку - << endl
    cout << "длина окружности = " << length; //вывод значения длины окружности
    return 0;
}
```
Отладьте и запустите программу, протестируйте ее работу на разных примерах.

Замечание: для получения значения числа π можно использовать std::numbers::pi (начиная с C++20) или предопределенные макроконстанты из <cmath> (для более ранних версий C++).

6. Известны радиус и высота цилиндра, найти его объем и площадь поверхности.
В качестве числа π использовать константу M_PI из математической библиотеки.
Использовать директивы #define _USE_MATH_DEFINES и #include \<cmath\>

7. Известны два целых числа. Найти и вывести сумму их последних цифр (использовать операцию %)
8. Известно целое четырехзначное число. Вывести его первую и последнюю цифры
9. С начала суток прошло N секунд (N — целое). Найти соответствующее количество полных часов и минут, и остаток секунд (неполная минута).
10. Даны длины ребер a, b, c прямоугольного параллелепипеда.
Найти его объем V = a·b·c и площадь поверхности S = 2·(a·b + b·c + a·c).
