# Лабораторная работа 1.

**Подготовьте и проверьте работоспособность среды для разработки на C++**

## 1 вариант

Установить VS Code - https://code.visualstudio.com/

Настроить его для C++: установить компилятор, ... + расширение для VS Code,  
инструкции и примеры - https://code.visualstudio.com/docs/languages/cpp

или -- аналогично с любым другим подходящим редактором кода

## 2 вариант

Установить IDE

Visual Studio (только для Windows и Mac) - https://visualstudio.microsoft.com

или

любую другую подходящую IDE для работы с C++

---

## Задачи для самостоятельного выполнения

### 1. Рассмотрите пример простой программы:

**Известны стороны прямоугольника. Составить программу, выводящую на экран его площадь.**

Пример решения:

```cpp
#include <iostream>
using namespace std;

int main()
{
    setlocale(0, ""); //
    double a, b, s; // объявление трех вещественных переменных
    cout << "Введите длины сторон \n"; // вывод на экран подсказки Введите длины сторон и
    // перевод курсора на новую строку - \n
    cout << "a= "; // вывод a=
    cin >> a; // ввод значения в переменную a
    cout << "b= "; // вывод b=
    cin >> b; // ввод значения в переменную b
    s = a * b; // вычисление значения переменной s
    cout << "S = " << s; //вывод S= и значения переменной s
    return 0;
}